app/controllers/product_controller.rb

INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`) VALUES ('My Widget', 20.0, '2017-11-06 07:49:50', '2017-11-06 07:49:50')
---
  def create
    # binding.pry
    # return render :text => "hello", :status => 520
    product = Product.new(:name => params[:product][:name], :price => params[:product][:price])
    # binding.pry

    product.save

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 980190975 LIMIT 1
---
  def edit
    @pro = Product.find(params[:id])